Repository: sushain97/apertium-monorepo-svn-82937
Catalog: incubator/en-ga-corpus/tmx/1922-1.tmx
Source language: en
Languages: ga

source: All judges shall be independent in the exercise of their functions, and subject only to the Constitution and the law
ga: Le linn feidhmithe dhóibh beidh na breithiúin uile nea-spleách agus fé riail an Bhun-reachta agus an dlí amháin

source: A judge shall not be eligible to sit in the Oireachtas, and shall not hold any other office or position of emolument
ga: Ní bheidh breitheamh iontoghtha chun suidhe san Oireachtas, agus ní bheidh aon oifig ná ionad eile sochair aige

source: No one shall be tried save in due course of law, and extraordinary courts shall not be established, save only such Military Tribunals as may be authorised by law for dealing with Military offenders against military law
ga: Ní trialfar éinne ach do réir chúrsaí cuibhe na dlí, agus ní bunófar cúirteanna nea-choitianta, ach amháin pé Binsi Airm a údarófar le dlí chun lucht airm a bhrisfidh dlí airm do thriail

source: The jurisdiction of Military Tribunals shall not be extended to or exercised over the civil population save in time of war, or armed rebellion, and for acts committed in time of war or armed rebellion, and in accordance with the regulations to be prescribed by law
ga: Ní shroichfidh údarás na mBinsi Airm chun an phobail shíbhialta ná ní cuirfear i bhfeidhm ortha é ach in aimsir chogaidh no rebiliúntachta armtha agus mar gheall ar ghníomhartha a déanfar in aimsir chogaidh no rebiliúntachta armtha, agus do réir na rialacha a socrófar le dlí

source: Such jurisdiction shall not be exercised in any area in which all civil courts are open or capable of being held, and no person shall be removed from one area to another for the purpose of creating such jurisdiction
ga: Ní cuirfear an t-údarás san i bhfeidhm in aon líomatáiste 'na bhfuil na cúirteanna síbhialta go léir oscailte no 'narbh fhéidir iad do chomóra agus ní aistreofar aon duine ó líomatáiste go chéile chun a leithéid d'údarás do chruithniú

source: A member of the armed forces of the Irish Free State (Saorstát Eireann) not on active service shall not be tried by any Court Martial or other Military Tribunal for an offence cognisable by the Civil Courts, unless such offence shall have been brought expressly within the jurisdiction of Courts Martial or other Military Tribunal by any code of laws or regulations for the enforcement of military discipline which may be hereafter approved by the Oireachtas
ga: Aon duine d'fhórsaí armtha Shaorstáit Éireann ná beidh ar seirbhís chogúil ní thrialfaidh aon Chúirt Airm ná aon Bhinse eile Airm é in aon choir intrialta ag sna Cúirteanna Síbhialta mara dtabharfar an choir sin go speisialta laistigh d'údarás Chúirteanna Airm, no aon Bhinse eile Airm, le haon chórus dlithe no rialacha chun smacht airm do chur i bhfeidhm a mholfaidh an t-Oireachtas 'na dhiaidh seo

source: No person shall be tried on any criminal charge without a jury save in the case of charges in respect of minor offences triable by law before a Court of Summary Jurisdiction and in the case of charges for offences against military law triable by Court Martial or other Military Tribunal
ga: Ní trialfar aon duine in aon chúis choiriúil gan choiste ach i gcás cúiseanna timpeal mion-choirthe atá intrialta le dlí i láthair Chúirt Údaráis Achmair agus i gcás cúiseanna timpeal coirthe i gcoinnibh dlí airm atá intrialta ag Cúirt Airm no Binse eile Airm

source: Subject to this Constitution and to the extent to which they are not inconsistent therewith, the laws in force in the Irish Free State (Saorstát Eireann) at the date of the coming into operation of this Constitution shall continue to be of full force and effect until the same or any of them shall have been repealed or amended by enactment of the Oireachtas
ga: Gan dochar don Bhun-reacht so agus sa méid ná fuilid buiniscionn leis, leanfaidh na dlithe atá i bhfeidhm i Saorstát Éireann le linn teacht i ngníomh don Bhun-reacht so i lán-neart agus i lán-fheidhm go dtí go n-ath-ghairmfear no go leasófar iad no aon cheann aca le hachtú den Oireachtas

source: Nothing in this Constitution shall affect any liability to pay any tax or duty payable in respect of the financial year current at the date of the coming into operation of this Constitution or any preceding financial year, or in respect of any period ending on or before the last day of the said current financial year, or payable on any occasion happening within that or any preceding year, or the amount of such liability; and during the said current financial year all taxes and duties and arrears thereof shall continue to be assessed, levied and collected in like manner in all respects as immediately before this Constitution came into operation, subject to the like adjustments of the proceeds collected as were theretofore applicable; and for that purpose the Executive Council shall have the like powers and be subject to the like liabilities as the Provisional Government
ga: Ní dhéanfaidh éinní sa Bhun-reacht so deifir d'aon fhiachas chun aon cháin no diúité do dhíol i dtaobh na bliana airgid ag rith le linn dáta an Bhun-reachta so do theacht i bhfeidhm, ná i dtaobh aon bhliana airgid roimhe sin, ná i dtaobh aon tréimhse a chríochnóidh ar an lá deireannach den bhliain airgid reatha roimh-ráite no roimhe, ná i dtaobh aon ócáide laistigh den bhliain sin no d'aon bhliain roimhe sin, ná fós aon deifir do mhéid a leithéid d'fhiachas; agus i gcaitheamh na bliana airgid reatha roimhráite leanfar de gach cáin agus diúité agus gach riaráiste den bhfiachas san do ghearra agus do leaga agus do bhailiú ar an gcuma cheanan chéanna do dintí é díreach roimh an mBun-reacht so do theacht i bhfeidhm, agus déanfar an cóiriú céanna do dintí roimhe seo ar an méid a baileofar; agus chun na críche sin, beidh na comhachta céanna ag an Ard-Chomhairle do bhí ag an Rialtas Sealadach agus beidh sí freagarthach sa tslí chéanna 'na raibh an Rialtas san

source: Goods transported during the said current financial year from or to the Irish Free State (Saorstát Eireann) to or from any part of Great Britain or the Isle of Man shall not, except so far as the Executive Council may otherwise direct, in respect of the forms to be used and the information to be furnished, be treated as goods exported or imported, as the case may be
ga: Earraí a beirtear i gcaitheamh na bliana airgid reatha roimhráite ó Shaorstát Éireann go dtí aon pháirt den Bhreatain Mhóir no d'Oileán Mhanainn, no a tugtar ó aon pháirt den Bhreatain Mhóir no d'Oileán Mhanainn go dtí Saorstát Éireann, ní áireófar iad mar earraí amach no isteach do réir mar bheidh, ach sa méid go n-órdóidh an Ard-Chomhairle a mhalairt i dtaobh na bhfuirmeacha a bheidh le húsáid agus an eolais a bheidh le tabhairt 'na dtaobh

source: For the purpose of this Article, the expression "financial year" means, as respects income tax (including super-tax) the year of assessment, and as respects other taxes and duties, the year ending on the thirty-first day of March
ga: Chun críche an Airtiogail seo, cialluíonn an focal “bliain airgid” maidir le cáin ioncuim (mar aon le barra-cháin) bliain a gearrtha, agus maidir le cánacha agus diúitéthe eile, an bhlíain a chríochnuíonn ar an t-aonú lá déag ar fhichid de Mhárta

source: Until Courts have been established for the Irish Free State (Saorstát Eireann) in accordance with this Constitution, the Supreme Court of Judicature, County Courts, Courts of Quarter Sessions and Courts of Summary Jurisdiction, as at present existing, shall for the time being continue to exercise the same jurisdiction as heretofore, and any judge or justice, being a member of any such Court, holding office at the time when this Constitution comes into operation, shall for the time being continue to be a member thereof and hold office by the like tenure and upon the like terms as heretofore, unless, in the case of a judge of the said Supreme Court or of a County Court, he signifies to the Representative of the Crown his desire to resign
ga: Go dtí go mbunófar Cúirteanna do Shaorstát Éireann do réir an Bhun-reachta so, leanfaidh an Chúirt Uachtarach Údaráis, na Cúirteanna Contae, na Cúirteanna Ceathrú Shiosóin agus na Cúirteanna Údaráis Achmair, mar atáid anois, don údarás céanna do chur i bhfeidhm de thurus na huaire mar a dhinidís go dtí so, agus aon bhreitheamh no giúistís, atá 'na bhall d'aon Chúirt dá sórt, agus atá in oifig le linn an Bhunreachta so do theacht i bhfeidhm, leanfa sé de thurus na huaire ar bheith 'na bhall dí, agus fanfa sé in oifig do réir na seilbhe céanna agus ar na téarmaí céanna do bhí aige go dtí so, ach i gcás breithimh den Chúirt Uachtarach roimh-ráite no de Chúirt Chontae, mara gcuirfidh sé in úil d'Ionadaí na Coróinneach gur mian leis tabhairt suas

source: Any vacancies in any of the said Courts so continued may be filled by appointment made in like manner as appointments to judgeships in the Courts established under this Constitution: Provided that the provisions of Article 66 of this Constitution as to the decisions of the Supreme Court established under this Constitution shall apply to decisions of the Court of Appeal continued by this Article
ga: Féadfar aon fhollamhntas in aon cheann de sna Cúirteanna roimh-ráite ar a leanfar amhlaidh do líona le ceapa a déanfar sa tslí chéanna a ceapfar breithiúin sna Cúirteanna atá á bhunú fén mBun-reacht so: Ar choiníoll go mbainfidh forálacha Airtiogail 66 den Bhun-reacht so i dtaobh breitheanna den Chúirt Uachtarach a bunófar fén mBun-reacht so le breitheanna Cúirte na hAith-éisteachta ar a leanfar do réir an Airtiogail seo

source: If any judge of the said Supreme Court of Judicature or of any of the said County Courts on the establishment of Courts under this Constitution, is not with his consent appointed to be a judge of any such Court, he shall, for the purpose of Article 10 of the Scheduled Treaty, be treated as if he had retired in consequence of the change of Government effected in pursuance of the said Treaty, but the rights so conferred shall be without prejudice to any rights or claims that he may have against the British Government
ga: Má bhíonn aon bhreitheamh den Chúirt Uachtarach Údaráis roimh-ráite no d'aon cheann de sna Cúirteanna Contae roimhráite le linn Cúirteanna do bhunú fén mBun-reacht so, ná ceaptar le n-a thoil féin chun bheith 'na bhreitheamh d'aon Chúirt dá sórt, déanfar leis, chun críche Airtiogail 10 den Chonnradh Sgeidealta, i leith is gur fhág sé oifig toisc an atharuithe Rialtais do tháinig i bhfeidhm de dheasgaibh an Chonnartha róimh-ráite, ach beidh gach ceart a bronnfar amhlaidh gan dochar d'aon cheart ná éileamh a bheadh aige i gcoinnibh Rialtais na Breataine

source: Every existing officer of the Provisional Government at the date of the coming into operation of this Constitution (not being an officer whose services have been lent by the British Government to the Provisional Government) shall on that date be transferred to and become an officer of the Irish Free State (Saorstát Eireann), and shall hold office by a tenure corresponding to his previous tenure
ga: Gach oifigeach den Rialtas Sealadach atá ann le linn an Bhun-reachta so do theacht i bhfeidhm (agus nách oifigeach é gur thug Rialtas na Breataine a sheirbhísí ar iasacht don Rialtas Sealadach) aistreofar é ar an ndáta san agus déanfaidh de oifigeach de Shaorstát Éireann, agus beidh aige seilbh oifige a bheidh ar có-réir leis an seilbh oifige do bhí aige cheana

source: Every such existing officer who was transferred from the British Government by virtue of any transfer of services to the Provisional Government shall be entitled to the benefit of Article 10 of the Scheduled Treaty
ga: Gach oifigeach den tsórt san ann do haistríodh ó Rialtas na Breataine de bhrí aon aistriú seirbhísí chun an Rialtais Shealadaigh, beidh sé i dteideal tairbhe Airtiogail 10 den Chonnradh Sgeidealta d'fháil

source: The transfer of the administration of any public service, the administration of which was not before the date of the coming into operation of this Constitution transferred to the Provisional Government, shall be deferred until the 31st day of March, 1923, or such earlier date as may, after one month's previous notice in the Official Gazette, be fixed by the Executive Council; and such of the officers engaged in the administration of those services at the date of transfer as may be determined in the manner hereinafter appearing shall be transferred to and become officers of the Irish Free State (Saorstát Eireann); and Article 77 of this Constitution shall apply as if such officers were existing officers of the Provisional Government who had been transferred to that Government from the British Government
ga: Aon tseirbhís phuiblí nár aistríodh a riara go dtí an Rialtas Sealadach roimh dháta an Bhun-reachta so do theacht i bhfeidhm, cuirfear aistriú a riartha siar go dtí an 31adh lá de Mhárta, 1923, no go dtí dáta is luaithe ná san ar a gcinnfidh an Ard-Chomhairle tar éis fógra mí do thabhairt roimh ré san Iris Oifigiúil; agus an méid sin de sna hoifigigh ag obair i riara na seirbhísí sin ar dháta an aistrithe ar a gcinnfear sa tslí atá luaidhte 'na dhiaidh seo, aistreofar iad agus déanfaidh díobh oifigigh de Shaorstát Éireann; agus beidh d'fheidhm ag Airtiogal 77 den Bhun-reacht so 'na dtaobh i leith is gur oifigigh den Rialtas Sealadach do haistríodh chun an Rialtais sin ó Rialtas na Breataine na hoifigigh sin

source: The officers to be so transferred in respect of any services shall be determined in like manner as if the administration of the services had before the coming into operation of the Constitution been transferred to the Provisional Government
ga: Cinnfear ar na hoifigigh a bheidh le haistriú amhlaidh i dtaobh aon tseirbhísí sa tslí chéanna i leith is go raibh riara na seirbhísí aistrithe chun an Rialtais Shcaladaigh roimh an mBun-reacht so do theacht i bhfeidhm

source: As respects departmental property, assets, rights and liabilities, the Government of the Irish Free State, (Saorstát Eireann) shall be regarded as the successors of the Provisional Government, and, to the extent to which functions of any department of the British Government become functions of the Government of the Irish Free State (Saorstát Eireann), as the successors of such department of the British Government
ga: Maidir le maoin, earraí, cearta agus fiachaisí bhaineas le ranna Rialtais, tuigfear gurb iad Rialtas Shaorstáit Éireann comharbaí an Rialtais Shealadaigh, agus sa méid go ndéanfaidh feidhmeanna de Rialtas Shaorstáit Éireann d'fheidhmeanna aon roinne de Rialtas na Breataine, tuigfear gurb iad Rialtas Shaorstáit Éireann comharbaí na roinne sin de Rialtas na Breataine

source: After the date on which this Constitution comes into operation the House of the Parliament elected in pursuance of the Irish Free State (Agreement) Act, 1922 (being the constituent assembly for the settlement of this Constitution), may, for a period not exceeding one year from that date, but subject to compliance by the members thereof with the provisions of Article 17 of this Constitution, exercise all the powers and authorities conferred on Dáil Eireann by this Constitution, and the first election for Dáil Eireann under Articles 26, 27 and 28 hereof shall take place as soon as possible after the expiration of such period
ga: Tar éis dáta an Bhun-reachta so do theacht i bhfeidhm féadfaidh Tigh na Páirliminte, do toghadh do réir an Achta um Shaorstát Éireann (Socrú), 1922, (gurb í an dáil bhunaidh í chun an Bu -reacht so do shocrú), na comhachta agus na húdaráis uile a thugann an Bun-reacht so do Dháil Éireann do chur i bhfeidhm ar feadh tréimhse ná raghaidh thar bliain ón ndáta san, ach chuige sin go mbeidh ar theachtaí na Páirliminte sin forálacha Airtiogail 17 den Bhun-reacht so do chó-líona agus déanfar an chéad toghachán do Dháil Éireann fé Airtiogail 26, 27, agus 28 de seo chó luath agus is féidir tar éis deire na tréimhse sin

source: Notwithstanding anything contained in Articles 14 and 33 hereof, the first Seaned Eireann shall be constituted immediately after the coming into operation of this Constitution in the manner following, that is to say:—
ga: D'ainneoin éinní dá bhfuil in Airtiogail 14 agus 33 de seo bunófar céad Sheanad Éireann láithreach tar éis an Bhun reachta so do theacht i bhfeidhm, sa tslí seo leanas, sé sin le rá:—

source: ( a ) The first Seanad Eireann shall consist of sixty members, of whom thirty shall be elected and thirty shall be nominated
ga: (a) I gcéad Sheanad Éireann beidh trí fichid ball dá dtoghfar deich dhuine fhichead agus dá n-ainmneofar deich dhuine fhichead

source: ( b ) The thirty nominated members of Seanad Eireann shall be nominated by the President of the Executive Council who shall, in making such nominations, have special regard to the providing of representation for groups or parties not then adequately represented in Dáil Eireann
ga: (b) Is é Uachtarán na hArd-Chomhairle a ainmneoidh na deich mbaill fhichead de Sheanad Éireann atá le hainmniú, agus le linn do an t-ainmniúchán san do dhéanamh tabharfa sé aire speisialta go soláthrófar ionaduíocht do ghasraí no do pháirtithe ná beidh leor-ionaduíocht aca i nDáil Éireann an uair sin

source: ( c ) The thirty elected members of Seanad Eireann shall be elected by Dáil Eireann voting on principles of Proportional Representation
ga: (c) Is í Dáil Éireann a thoghfaidh le vótáil a déanfar do réir Ionaduíochta Cothromúla na deich mbaill fhichead de Sheanad Éireann atá le togha

source: ( d ) Of the thirty nominated members, fifteen to be selected by lot shall hold office for the full period of twelve years, the remaining fifteen shall hold office for the period of six years
ga: (d) De sna deich mbaill fhichead a ainmneófar leanfaidh chúig dhuine dhéag a toghfar le crann-chur, in oifig ar feadh na lán-tréimhse de dhá bhliain déag, leanfaidh na chúig dhuine dhéag eile in oifig ar feadh sé mblian

source: ( e ) Of the thirty elected members the first fifteen elected shall hold office for the period of nine years, the remaining fifteen shall hold office for the period of three years
ga: (e) De sna deich mbaill fhichead a toghfar leanfaidh an chéad chúig dhuine dhéag a toghfar in oifig ar feadh naoi mblian, agus leanfaidh na chúig dhuine dhéag eile in oifig ar feadh trí mblian

source: ( f ) At the termination of the period of office of any such members, members shall be elected in their place in manner provided by Article 32 of this Constitution
ga: (f) Ar chríochnú tréimhse oifige aon bhall den tsórt san toghfar baill 'na n-ionad i slí a fhorálann Airtiogal 32 den Bhun-reacht so

source: ( g ) Casual vacancies shall be filled in manner provided by Article 34 of this Constitution
ga: (g) Líonfar foth-fhollamhntaisí i slí a fhorálann Airtiogal 34 den Bhun-reacht so

source: The passing and adoption of this Constitution by the Constituent Assembly and the British Parliament shall be announced as soon as may be, and not later than the sixth day of December, Nineteen hundred and twenty-two, by Proclamation of His Majesty, and this Constitution shall come into operation on the issue of such Proclamation
ga: Fógrófar chó luath agus is féidir agus ar an séú lá de Mhí na Nodlag Naoi gcéad déag agus a dó fichead an tráth is déana dhe, le Furóga ó n-a Shoillse, gur rith agus gur ghlac an Dáil Bhunaidh agus Páirlimint na Breataine an Bun-reacht so, agus tiocfaidh an Bun-reacht so i bhfeidhm ar fhoillsiú an Fhurógra san
